app/Http/Controllers/Auth/LoginController.php

    public function handleProviderCallback(\Request $request)
    {
        try {
            $user_google    = Socialite::driver('google')->user();
            $user           = User::where('email', $user_google->getEmail())->first();
---
select * from `users` where `email` = 'davinawijaya03@gmail.com' limit 1