app/Http/Controllers/CategoryController.php

select * from `categories` limit 10 offset 0
select count(*) as aggregate from `categories`
---
    public function index(Request $request)
    {
        if($request->has('search')){
            return view('ourlayouts.kategori.data-kategori',[
                'title' =>'Kategori',
                'categories' => Category::where('name','like','%'.$request->search.'%')->orWhere('description', 'like', '%'.$request->search.'%')->paginate()
            ]);
        }else{
            return view('ourlayouts.kategori.data-kategori',[
                'title' =>'Kategori',
                 'categories' => Category::paginate(10),

insert into `categories` (`name`, `updated_at`, `created_at`) values ('a', '2022-12-20 09:23:45', '2022-12-20 09:23:45')
---
    public function store(StoreCategoryRequest $request)
    {
        $this->validate($request, [
            'name' => 'required',
        ]);

        Category::create([
            'name' => $request->name
        ]);

select * from `categories` where `categories`.`id` = '4' limit 1
update `categories` set `name` = 'abc', `categories`.`updated_at` = '2022-12-20 09:25:16' where `id` = 4
---
    public function update(UpdateCategoryRequest $request, $id)
    {
        $category = Category::findOrFail($id);

        $category->update([
            "name" => $request->name
        ]);