app/Http/Controllers/LetterController.php

    public function index(Request $request)
    {
        // if($request->has('search')){
        //     // dd('tes');
        //     return view('ourlayouts.surat.data-surat',[
        //         'title' =>'Surat',
        //         'letters' => Letter::where(
        //             'name','like','%'.$request->search.'%')
        //             ->orWhere('email', 'like', '%'.$request->search.'%')
        //             ->orWhere('phone', 'like', '%'.$request->search.'%')
        //             ->orWhere('file', 'like', '%'.$request->search.'%')
        //             ->orWhere('message', 'like', '%'.$request->search.'%')
        //             ->paginate(),
        //         // 'templates' => Template::whereRelation('template', 'name', 'like','%'.$request->search.'%')->get(),
        //     ]);
        // }else{
           // $temp=Template::all();
            // $letters = Letter::where(function ($query) use ($temp) {
            //     $query->whereIn('template_id', $temp->id);
            // })->paginate(10);\
            // $letters= Letter::where('template_id','=',"3")->paginate(10);
            return view('ourlayouts.surat.data-surat',[
                'title' =>'Surat',
                'proses' =>'',
                'search' =>'',
               'letters' => Letter::paginate(10),
                // 'letters' => $letters

                // 'template' => Template::all()
            ]);
---
select * from `templates`
select * from `letters` limit 10 offset 0
select count(*) as aggregate from `letters`

    public function filterstatus(Request $request){
        // dd('tes');

        // Get filter criteria from the form submission
        $search = $request->input('search');
        $proses = $request->input('proses');

        return view('ourlayouts.surat.data-surat', [
            'pagetitle' =>'surat',
            'search' => $search,
            'proses' => $proses,
            'maintitle' =>'surat',
            'letters' => Letter::where(function($query) use ($search) {
                $query->where('name', 'like', '%'.$search.'%')
                      ->orWhere('phone', 'like', '%'.$search.'%')
                      ->orWhere('email', 'like', '%'.$search.'%');
            })
            ->when($proses != '#', function($query) use ($proses) {
                $query->where('proses', $proses);
            })
            ->paginate(10)
        ]);
---
select * from `letters`

    public function edit($id)
    {
        return view("ourlayouts.surat.update-suratonline",[
            'letter' => Letter::findOrFail($id),
            'templates' => Template::all(),
            'maintitle' => 'Perbarui Surat Online'
        ]);
---
select * from `letters` where `letters`.`id` = '5' limit 1