app/Http/Controllers/ReportController.php

select * from `reports` limit 10 offset 0
select count(*) as aggregate from `reports`
---
    public function index()
    {
<<<<<<< Updated upstream
        //
=======
        // if($request->has('search')){
        //     return view('ourlayouts.pelaporan.data-pelaporan',[
        //         'title' =>'pelaporan',
        //         'reports' => Report::where(
        //             'name','like','%'.$request->search.'%')
        //             ->orWhere('description', 'like', '%'.$request->search.'%')
        //             ->orWhere('phone', 'like', '%'.$request->search.'%')
        //             ->paginate(),
        // ]);
        // }else{
            return view('ourlayouts.pelaporan.data-pelaporan',[
                'title' =>'pelaporan',
                'proses' =>'',
                'search' =>'',
                'reports' => Report::paginate(10)

select count(*) as aggregate from `reports` where (`name` like '%gab%' or `description` like '%gab%' or `phone` like '%gab%') and `proses` = 'menunggu'
---
    public function filterstatus(Request $request){
        // dd('tes');

        // Get filter criteria from the form submission
        $search = $request->input('search');
        $proses = $request->input('proses');

        return view('ourlayouts.pelaporan.data-pelaporan', [
            'pagetitle' =>'pelaporan',
            'search' => $search,
            'proses' => $proses,
            'maintitle' =>'pelaporan',
            'reports' => Report::where(function($query) use ($search) {
                $query->where('name', 'like', '%'.$search.'%')
                      ->orWhere('description', 'like', '%'.$search.'%')
                      ->orWhere('phone', 'like', '%'.$search.'%');
            })
            ->when($proses != '#', function($query) use ($proses) {
                $query->where('proses', $proses);
            })
            ->paginate()

select * from `reports`
---
    public function create()
    {
<<<<<<< Updated upstream
        //
=======
        return view('ourlayouts.pelaporan.add-pelaporan', [
            'title' =>'pelaporan',
            'reports' => Report::all(),
        ]);

select * from `reports` where `reports`.`id` = '3' limit 1
select * from `users`
---
    public function edit(Report $report)
    {
<<<<<<< Updated upstream
        //
=======
        // dd('t');
        return view("ourlayouts.pelaporan.updatepelaporan",[
            'report' => Report::findOrFail($id),
            'user' => User::all(),
        ]);