app/Http/Controllers/StructureController.php

    public function index(Request $request)
    {
<<<<<<< Updated upstream
        //design view blm ada
        if($request->has('search')){
            return view('ourlayouts.penduduk.data-penduduk',[
                'title' =>'Penduduk',
                'structures' => Writer::where(
                    'name','like','%'.$request->search.'%')
                    ->orWhere('appointed_date', 'like', '%'.$request->search.'%')
                    ->orWhere('resign_date', 'like', '%'.$request->search.'%')
                    ->paginate(),
                'positions' => Position::whereRelation('position', 'name', 'like','%'.$request->search.'%')->get(),
                'villagers' => Position::whereRelation('villager', 'name', 'like','%'.$request->search.'%')->get(),
            ]);
        }else{
            return view('ourlayouts.penduduk.data-penduduk',[
                'title' =>'Penduduk',
                'structures' => Writer::paginate(10),
=======
        // if($request->has('search')){
        //     $searchTerm = $request->search;
        //     return view('ourlayouts.perangkat.data-perangkat',[
        //         'title' =>'Perangkat',
        //         'structures' => Structure::where(function($query) use ($searchTerm){
        //             $query->where('appointed_date','like','%'.$searchTerm.'%')
        //             ->orWhere('resign_date', 'like', '%'.$searchTerm.'%')
        //             ->orWhere('status_jabat', 'like', '%'.$searchTerm.'%');
        //         })->orWhereHas('villager', function($query) use ($searchTerm){
        //             $query->where('name','like','%'.$searchTerm.'%');
        //         })->orWhereHas('position', function($query) use ($searchTerm){
        //             $query->where('name','like','%'.$searchTerm.'%');
        //         })->paginate(),
        //     ]);
        // }else{
            return view('ourlayouts.perangkat.data-perangkat',[
                'title' =>'Perangkat',
                'search' =>'',
                'status_jabat' =>'',
                'structures' => Structure::paginate(10),
>>>>>>> Stashed changes
                'positions' => Position::all(),
                'villagers' => Villager::all(),
            ]);
---
select * from `positions`
select * from `structures` limit 10 offset 0
select count(*) as aggregate from `structures`
select * from `villagers`

    public function filterstatus(Request $request){

        // Get filter criteria from the form submission
        $search = $request->input('search');
        $status_jabat = $request->input('status_jabat');

        return view('ourlayouts.perangkat.data-perangkat', [
            'pagetitle' =>'perangkat',
            'search' => $search,
            'status_jabat' => $status_jabat,
            'maintitle' =>'perangkat',
            'structures' => Structure::select("*")
            ->with('position','villager')
            ->when($search !='', function($query) use ($search) {
                $query->whereHas('villager', function($query) use ($search) {
                    $query->where('name', 'like', '%'.$search.'%');
                })
                ->orWhere('appointed_date', 'like', '%'.$search.'%')
                ->orWhere('resign_date', 'like', '%'.$search.'%');
            })
            ->when($status_jabat != '#', function($query) use ($status_jabat) {
                $query->where('status_jabat', $status_jabat);
            })
            ->paginate(10)
        ]);
---
select * from `positions` where `positions`.`id` in (3)
select * from `structures` where exists (select * from `villagers` where `structures`.`villager_id` = `villagers`.`id` and `name` like '%cahyadi%') or `appointed_date` like '%cahyadi%' or `resign_date` like '%cahyadi%' and `status_jabat` = 'selesai' limit 10 offset 0
select * from `villagers` where `villagers`.`id` in (3)
select count(*) as aggregate from `structures` where exists (select * from `villagers` where `structures`.`villager_id` = `villagers`.`id` and `name` like '%cahyadi%') or `appointed_date` like '%cahyadi%' or `resign_date` like '%cahyadi%' and `status_jabat` = 'selesai'