app/Http/Controllers/VillagerController.php

select * from `villagers` limit 100 offset 0
select count(*) as aggregate from `villagers`
---
    public function index(Request $request)
    {
        // if($request->has('query')){
        //
        //     return view('ourlayouts.penduduk.data-penduduk',[
        //         'pagetitle' =>'Penduduk',
        //         'maintitle' =>'Penduduk',
        //         'villagers' => Villager::where(
        //             'name','like','%'.$request->input('query').'%')
        //             // ->orWhere('birth_place', 'like', '%'.$request->input('query').'%')
        //             // ->orWhere('birth_date', 'like', '%'.$request->input('query').'%')
        //             ->orWhere('nik', 'like', '%'.$request->input('query').'%')
        //             // ->orWhere('phone', 'like', '%'.$request->input('query').'%')
        //             // ->orWhere('role', 'like', '%'.$request->input('query').'%')
        //             // ->orWhere('gender', 'like', '%'.$request->input('query').'%')
        //             // ->orWhere('status', 'like', '%'.$request->input('query').'%')
        //             ->paginate(),
        //     ]);
        // }else{
            return view('ourlayouts.penduduk.data-penduduk',[
                'title' =>'Penduduk',
                'villagers' => Villager::paginate(100),

select count(*) as aggregate from `villagers` where `status` = 'hidup'
select count(*) as aggregate from `villagers` where `status` = 'hidup' and `gender` = 'perempuan'
select count(*) as aggregate from `villagers` where `status` = 'hidup' and `gender` = 'laki-laki'
---
    public function showGraphic()
    {
        //awal
        $sumVillagers = Villager::where('status','hidup')->count();
        $girls = Villager::where('status','hidup')->where('gender','perempuan')->count();
        $boys = Villager::where('status','hidup')->where('gender','laki-laki')->count();

select `gender`, `status` from `villagers`
select `gender`, `role`, `status` from `villagers`
---
            ->get();

        //buat grafik status
        $villagers1 = Villager::select('gender', 'status')->get();

        //buat grafik peran
        $villagers2 = Villager::select('gender', 'role','status')->get();